## plan
```diff
+ Green
- Red
! Orange
@@ Pink @@
#Gray
data.http.my_public_ip: Reading...
random_id.this: Refreshing state... [id=3A]
data.http.my_public_ip: Read complete after 1s [id=https://ifconfig.co/json]
data.aws_availability_zones.available: Reading...
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=447552758530]
aws_vpc.this[0]: Refreshing state... [id=vpc-0253c98dbfb2527bc]
data.aws_availability_zones.available: Read complete after 0s [id=us-west-2]
random_shuffle.az: Refreshing state... [id=-]
aws_subnet.private[0]: Refreshing state... [id=subnet-05d3787cbf200ae15]
aws_security_group.trusted[0]: Refreshing state... [id=sg-0f1628227c3620510]
aws_subnet.public[0]: Refreshing state... [id=subnet-0bcb86926463a54da]
aws_security_group.lan[0]: Refreshing state... [id=sg-05eea34b7c5aad93d]
aws_route_table.public[0]: Refreshing state... [id=rtb-0e60bd76d51edd1e4]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-0bb7ce12cebee95cc]
aws_security_group.public[0]: Refreshing state... [id=sg-06ed1ac4a4a40a5df]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place

Terraform will perform the following actions:

  # aws_route.public_internet_gateway will be created
+   resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = "igw-0bb7ce12cebee95cc"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = "rtb-0e60bd76d51edd1e4"
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # aws_security_group.trusted[0] will be updated in-place
  ~ resource "aws_security_group" "trusted" {
        id                     = "sg-0f1628227c3620510"
      ~ ingress                = [
-           {
-               cidr_blocks      = [
-                   "13.84.54.58/32",
                ]
-               description      = "Allow all from trusted IP"
-               from_port        = 0
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 65535
            },
+           {
+               cidr_blocks      = [
+                   "20.7.147.94/32",
                ]
+               description      = "Allow all from trusted IP"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 65535
            },
        ]
        name                   = "Trusted Network"
        tags                   = {
            "Name" = "Trusted Network"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"     
```